# Brewfile

# --- Taps ---
tap "homebrew/bundle"
tap "nikitabobko/tap"

# --- Core CLI Tools ---
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "atuin"
brew "starship"
brew "mise"
brew "jq"
brew "gh"
brew "tmux"
brew "neovim"
brew "pre-commit"
brew "git"

# --- macOS Only ---
if OS.mac?
  cask "aerospace"
  cask "ghostty"
  cask "karabiner-elements"
  cask "1password-cli"
  cask "hiddenbar"
  cask "maccy"
  cask "alt-tab"
  cask "orbstack"
  cask "obsidian"
  cask "cursor"
  cask "brave-browser"
  cask "slack"
  cask "spotify"
  cask "discord"
  cask "font-sf-mono-nerd-font"
end
