# Brewfile

# --- Taps ---
tap "nikitabobko/tap"
tap "raine/workmux"

# --- Core CLI Tools ---
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "atuin"
brew "starship"
brew "mise"
brew "jq"
brew "gh"
brew "tmux"
brew "neovim"
brew "direnv"
brew "workmux"
brew "pre-commit"
brew "git"
brew "difftastic"     # AST-aware structural diffs
brew "ast-grep"       # Structural code search/rewrite
brew "git-absorb"     # Auto fixup commits for rebase
brew "gitleaks"       # Secret scanning (pre-commit hook)
brew "hurl"           # Declarative HTTP testing
brew "btop"           # System/process monitor TUI
brew "shellcheck"     # Shell script linter
brew "dust"           # Disk usage visualization
brew "lazydocker"     # Docker TUI
brew "croc"           # P2P encrypted file transfer
brew "uv"             # Python package manager
brew "granted"        # AWS SSO credential management

# --- macOS Only ---
if OS.mac?
  cask "aerospace"
  cask "ghostty"
  cask "karabiner-elements"
  cask "1password-cli"
  cask "jordanbaird-ice"            # Menu bar management (replaces hiddenbar)
  cask "chatgpt"                   # ChatGPT desktop
  cask "itsycal"                   # Menu bar calendar
  cask "orbstack"
  cask "obsidian"
  cask "raycast"
  cask "cursor"
  cask "brave-browser"
  cask "slack"
  cask "spotify"
  cask "discord"
  cask "font-sf-mono-nerd-font"
  # Paprika Recipe Manager: install from Mac App Store
end
